[Imprinted.A_FaceOfFear_Imprinted_Buff_Fear H7BaseBuff]
mName="恐惧"
mTooltip="%stat %stat.icon 士气\n持续 %durnow 回合。"

[Imprinted.A_HauntingPlague_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="瘟疫缠身"
mTooltip="施法时和接下来2个战斗回合开始时，%buff1.buff.special1 个随机敌方生物获得“瘟疫缠身”减益。受影响的生物拥有 %buff2.buff.stat %icon_attack 攻击，并在战斗回合结束时受到 %buff2.buff.d %icon_dark 暗系伤害。"

[A_FaceOfFear_Buff H7BaseBuff]
mName="恐惧代言"
mTooltip="该生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气 %buff2.buff.stat.norm，持续 %buff2.buff.durini 回合。\n持续 %durnow 回合。"

[A_Despair_Buff H7BaseBuff]
mName="悲痛欲绝"
mTooltip="%stat %stat.icon 士气\n持续 %durnow 回合。"

[A_Weakness H7HeroAbility]
mTooltipMagicGuild="降低目标敌方生物的 %buff.buff.stat.icon 攻击，持续 %buff.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff.buff.stat %ICON_ATTACK 攻击"
mTooltipUpgraded="降低目标4x4区域内所有敌方生物 %buff.buff.stat.norm 点 %buff.buff.stat.icon 攻击，持续 %buff.buff.durini 回合。"
mName="虚弱无力"
mTooltip="降低目标敌方生物 %buff.buff.stat.norm 点 %buff.buff.stat.icon 攻击，持续 %buff.buff.durini 回合。"

[Imprinted.A_HauntingPlague_Imprinted_Buff_Hero H7BaseBuff]
mName="瘟疫缠身"
mTooltip="瘟疫缠身将在每个战斗回合开始时影响 %special1 个随机敌方生物。持续 %durnow 战斗回合。"

[A_ShadowImage_Buff_Upgraded H7BaseBuff]
mName="暗影镜像"
mTooltip="此暗影镜像在受到任何伤害时被摧毁。"

[Imprinted.A_Purge_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="法术废除"
mTooltip="立即从目标敌方生物移除 %special1 个正面魔法效果。"

[A_MalassasTemptation H7HeroAbility]
mTooltipMagicGuild="增加中立军队向英雄提出加入邀请的几率，直到当天结束。"
mTooltipMagicGuildRankLine="%buff.buff.stat 几率"
mTooltipUpgraded=""
mName="暗龙诱惑"
mTooltip="增加中立军队向英雄提出加入邀请的几率 %buff.buff.stat.norm，直到当天结束。"

[Imprinted.A_ShadowImage_Imprinted_Buff H7BaseBuff]
mName="暗影镜像"
mTooltip="此暗影镜像在受到任何伤害时被摧毁。"

[Imprinted.A_FaceOfFear_Imprinted_Buff H7BaseBuff]
mName="恐惧代言"
mTooltip="该生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气 %buff1.buff.buff2.buff.stat，持续 %buff1.buff.buff2.buff.durini 回合。持续 %durnow 回合。"

[Imprinted.A_Agony_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="无尽痛苦"
mTooltip="在目标敌方生物接下来的 %buff.buff.durini 个回合开始时，对其造成 %buff.buff.d.min 到 %buff.buff.d.max %buff.buff.d.icon 暗系伤害。"

[Imprinted.A_ShadowImage_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗影镜像"
mTooltip="召唤目标生物堆栈的复制体，大小为原体的 %special1.val2。复制体在受到任何伤害时被摧毁。"

[Imprinted.A_Despair_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="悲痛欲绝"
mTooltip="降低目标敌方生物 %buff.buff.stat.norm 点 %buff.buff.stat.icon 士气，持续 %buff.buff.durini 回合。"

[A_ShadowImage_Buff H7BaseBuff]
mName="暗影镜像"
mTooltip="此暗影镜像在受到任何伤害时被摧毁。"

[Imprinted.A_ShadowImage_Imprinted_Artifact H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗影镜像"
mTooltip="召唤目标生物堆栈的复制体，大小为原体的 %special1。复制体在受到任何伤害时被摧毁。"

[A_Agony_Buff H7BaseBuff]
mName="无尽痛苦"
mTooltip="在生物回合开始时，对其造成 %d.min 到 %d.max %d.icon 暗系伤害。持续 %durnow 回合。"

[A_Weakness_FromMoat_Buff H7BaseBuff]
mName="虚弱无力"
mTooltip="%stat %stat.icon 攻击\n持续 %durnow 回合。"

[Imprinted.A_MalassasTemptation_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗龙诱惑"
mTooltip="增加中立军队向英雄提出加入邀请的几率 %buff.buff.stat.norm，直到当天结束。"

[A_Weakness_FromCreature_Buff_Champion H7BaseBuff]
mName="虚弱无力"
mTooltip="%stat %stat.icon 攻击\n持续 %durnow 回合。"

[A_HauntingPlague_Buff_Creature H7BaseBuff]
mName="瘟疫缠身"
mTooltip="%stat %icon_attack 攻击，直到战斗回合结束。该生物将在战斗回合结束时受到 %d.min 到 %d.max %icon_dark 暗系伤害。"

[A_Weakness_FromCreature_Buff_Elite H7BaseBuff]
mName="虚弱无力"
mTooltip="%stat %stat.icon 攻击\n持续 %durnow 回合。"

[Imprinted.A_HauntingPlague_Imprinted_Buff_Creature H7BaseBuff]
mName="瘟疫缠身"
mTooltip="%stat %icon_attack 攻击，直到战斗回合结束。该生物将在战斗回合结束时受到 %d.min 到 %d.max %icon_dark 暗系伤害。"

[A_Purge_Buff_Curse H7BaseBuff]
mName="诅咒"
mTooltip="该生物在 %durnow 回合内不能被正面法术或效果选中。"

[Imprinted.A_MalassasTemptation_Imprinted_Buff H7BaseBuff]
mName="暗龙诱惑"
mTooltip="中立军队向英雄提出加入邀请的几率提高 %stat。\n持续到当天结束。"

[Imprinted.A_Weakness_Imprinted_Buff H7BaseBuff]
mName="虚弱无力"
mTooltip="%stat %stat.icon 攻击\n持续 %durnow 回合。"

[A_Purge H7HeroAbility]
mTooltipMagicGuild="立即从目标敌方生物移除一定数量的正面魔法效果。"
mTooltipMagicGuildRankLine="%special1 个效果 和 %special3 %ICON_MANA 法力消耗"
mTooltipUpgraded="立即从目标敌方生物移除 %special1 个正面魔法效果，并使其在 %buff.buff.durini 回合内对正面法术或效果免疫。"
mName="法术废除"
mTooltip="立即从目标敌方生物移除 %special1 个正面魔法效果。"

[Imprinted.A_Weakness_Imprinted H7HeroAbility]
mTooltipMagicGuild="降低目标敌方生物的 %buff.buff.stat.icon 攻击，持续 %buff.buff.durini 回合。"
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="降低目标4x4区域内所有敌方生物 %buff.buff.stat.norm 点 %buff.buff.stat.icon 攻击，持续 %buff.buff.durini 回合。"
mName="虚弱无力"
mTooltip="降低目标敌方生物 %buff.buff.stat.norm 点 %buff.buff.stat.icon 攻击，持续 %buff.buff.durini 回合。"

[A_FaceOfFear H7HeroAbility]
mTooltipMagicGuild="目标盟友生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气，持续 %buff1.buff.buff2.buff.durini 回合。持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.buff2.buff.stat %ICON_MORALE 士气"
mTooltipUpgraded="目标盟友生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气 %buff2.buff.buff2.buff.stat.norm，持续 %buff2.buff.buff2.buff.durini 回合。受惊吓的生物无法反击。持续 %buff2.buff.durini 回合。"
mName="恐惧代言"
mTooltip="目标盟友生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气 %buff1.buff.buff2.buff.stat.norm，持续 %buff1.buff.buff2.buff.durini 回合。持续 %buff1.buff.durini 回合。"

[A_Weakness_Buff H7BaseBuff]
mName="虚弱无力"
mTooltip="%stat %stat.icon 攻击\n持续 %durnow 回合。"


[A_FaceOfFear_Buff_Upgraded H7BaseBuff]
mName="恐惧代言"
mTooltip="该生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气 %buff2.buff.stat.norm，持续 %buff2.buff.durini 回合。受惊吓的生物无法反击。\n持续 %durnow 回合。"

[A_Agony_FromMoat_Buff H7BaseBuff]
mName="无尽痛苦"
mTooltip="在生物回合开始时，对其造成 %d.min 到 %d.max %d.icon 暗系伤害。持续 %durnow 回合。"

[A_HauntingPlague_Buff_Hero H7BaseBuff]
mName="瘟疫缠身"
mTooltip="瘟疫缠身将在每个战斗回合开始时影响 %special1 个随机敌方生物。持续 %durnow 战斗回合。"

[Imprinted.A_FaceOfFear_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="恐惧代言"
mTooltip="目标盟友生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气 %buff1.buff.buff2.buff.stat，持续 %buff1.buff.buff2.buff.durini 回合。持续 %buff1.buff.durini 回合。"

[Imprinted.A_Agony_Imprinted_Buff H7BaseBuff]
mName="无尽痛苦"
mTooltip="在生物回合开始时，对其造成 %d.min 到 %d.max %d.icon 暗系伤害。持续 %durnow 回合。"

[A_HauntingPlague H7HeroAbility]
mTooltipMagicGuild="施法时和接下来2个战斗回合开始时，一定数量的随机敌方生物获得“瘟疫缠身”减益。受影响的生物拥有 %buff2.buff.stat %icon_attack 攻击，并在战斗回合结束时受到 %icon_dark 暗系伤害。"
mTooltipMagicGuildRankLine="%buff1.buff.special1 个受影响的敌方生物。目标受到 %buff2.buff.d %icon_dark 暗系伤害。"
mTooltipUpgraded=""
mName="瘟疫缠身"
mTooltip="施法时和接下来2个战斗回合开始时，%buff1.buff.special1 个随机敌方生物获得“瘟疫缠身”减益。受影响的生物拥有 %buff2.buff.stat %icon_attack 攻击，并在战斗回合结束时受到 %buff2.buff.d %icon_dark 暗系伤害。"

[Imprinted.A_Despair_Imprinted_Buff H7BaseBuff]
mName="悲痛欲绝"
mTooltip="%stat %stat.icon 士气\n持续 %durnow 回合。"

[A_MalassasTemptation_Buff H7BaseBuff]
mName="暗龙诱惑"
mTooltip="中立军队向英雄提出加入邀请的几率提高 %stat。\n持续到当天结束。"

[Imprinted.A_Weakness_Imprinted_Buff H7BaseBuff]
mName="虚弱无力"
mTooltip="%stat %stat.icon 攻击\n持续 %durnow 回合。"

UCP 1.1



[A_ShadowCloak_Buff H7BaseBuff]
mName="暗影斗篷"
mTooltip="接下来的 %d.min 次攻击自动错过此生物。持续 %durnow 回合或直到所有攻击都未命中。"

[Imprinted.A_ShadowCloak_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗影斗篷"
mTooltip="接下来的 %buff.buff.d.min 次攻击自动错过目标友方生物。持续 %buff.buff.durini 回合或直到所有攻击都未命中。"

[Imprinted.A_ShadowCloak_Imprinted_Buff H7BaseBuff]
mName="暗影斗篷"
mTooltip="接下来的 %d.min 次攻击自动错过此生物。持续 %durnow 回合或直到所有攻击都未命中。"

[A_ShadowImage_Buff_ShadowCloak H7BaseBuff]
mName="暗影斗篷"
mTooltip="接下来的 %d.min 次攻击自动错过此生物。持续 %durnow 回合或直到所有攻击都未命中。"

UCP 1.1 New Buff

[A_ShadowCloak_Buff_Upgraded H7BaseBuff]
mName="暗影斗篷"
mTooltip="接下来的 %d.min 次攻击自动错过此生物。持续 %durnow 回合或直到所有攻击都未命中。"

UCP 1.3 / 7.5_mod

[A_ShadowCloak_Buff_resist H7BaseBuff]
mName="暗影斗篷"

[A_ShadowCloak_Buff_Resist_Upgraded H7BaseBuff]
mName="暗影斗篷"

[A_ShadowImage_Buff_Shadowcloak_Resist H7BaseBuff]
mName="暗影镜像"

[A_FaceOfFear_Buff_CatatonicFear H7BaseBuff]
mName="恐惧颤抖"
mTooltip="该生物无法反击，并获得 %stat %stat.icon 士气。\n持续 %durnow 回合。"

[A_FaceOfFear_Buff_Fear H7BaseBuff]
mName="恐惧"
mTooltip="%stat %stat.icon 士气\n持续 %durnow 回合。"



[rework.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="目标盟友生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气，持续 %buff1.buff.buff2.buff.durini 回合。持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.buff2.buff.stat %ICON_MORALE 士气"
mTooltipUpgraded="目标盟友生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气 %buff2.buff.buff2.buff.stat.norm，持续 %buff2.buff.buff2.buff.durini 回合。受惊吓的生物无法反击。持续 %buff2.buff.durini 回合。"
mName="恐惧代言"
mTooltip="目标盟友生物的近战攻击使敌人逃跑2格而非反击，并降低其 %ICON_MORALE 士气 %buff1.buff.buff2.buff.stat.norm，持续 %buff1.buff.buff2.buff.durini 回合。持续 %buff1.buff.durini 回合。"

v1.33

[Curse.A_Curse H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="诅咒"
mTooltip="目标敌方单位总是造成最小伤害（亡灵和构造体除外）。持续 %buff.buff.durini 回合。"

[Animation_dead.A_AnimateDead H7HeroAbility]
mTooltipMagicGuild="复活友方亡灵单位。"
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="操纵死尸"
mTooltip="复活 %d.min %icon_health 生命值的友方亡灵单位。"

v1.35

[rework3.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="召唤目标生物堆栈的复制体。复制体在受到任何伤害时被摧毁。"
mTooltipMagicGuildRankLine="大小为原体的 %special1.val1"
mTooltipUpgraded="召唤目标生物堆栈的复制体，大小为原体的 %special1.val2。复制体在受到任何伤害时被摧毁。第一次攻击自动错过复制体，除非它在3回合内未被攻击。\n（冷却时间：%buff9.buff.durini 回合）。"
mName="暗影镜像"
mTooltip="召唤目标生物堆栈的复制体，大小为原体的 %special1.val2。复制体在受到任何伤害时被摧毁。\n（冷却时间：%buff9.buff.durini 回合）"

v1.36 

[A_Agony H7HeroAbility]
mTooltipMagicGuild="在目标敌方生物接下来的 %buff1.buff.durini 个回合开始时，对其造成 %buff1.buff.d.icon 暗系伤害。"
mTooltipMagicGuildRankLine="%buff1.buff.d.min 到 %buff1.buff.d.max %ICON_DARK"
mTooltipUpgraded="在目标4x4区域内所有敌方生物接下来的 %buff1.buff.durini 个回合开始时，对其造成 %buff1.buff.d.min 到 %buff1.buff.d.max %buff.buff.d.icon 暗系伤害。\n（冷却时间：%buff9.buff.durini 回合）。"
mName="无尽痛苦"
mTooltip="在目标敌方生物接下来的 %buff1.buff.durini 个回合开始时，对其造成 %buff1.buff.d.min 到 %buff1.buff.d.max %buff1.buff.d.icon 暗系伤害。\n（冷却时间：%buff9.buff.durini 回合）。"

[A_Despair H7HeroAbility]
mTooltipMagicGuild="降低目标敌方生物的 %buff1.buff.stat.icon 士气，持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.stat %buff1.buff.stat.icon 士气"
mTooltipUpgraded="降低目标4x4区域内所有敌方生物 %buff1.buff.stat.norm 点 %buff1.buff.stat.icon 士气，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）。"
mName="悲痛欲绝"
mTooltip="降低目标敌方生物 %buff1.buff.stat.norm 点 %buff1.buff.stat.icon 士气，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）。"

v1.37

[rework1.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="施法时和接下来2个战斗回合开始时，一定数量的随机敌方生物获得“瘟疫缠身”减益。受影响的生物拥有 %buff2.buff.stat %icon_attack 攻击，并在战斗回合结束时受到 %icon_dark 暗系伤害。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%buff1.buff.special1 个受影响的敌方生物。目标受到 %buff2.buff.d %icon_dark 暗系伤害。"
mTooltipUpgraded=""
mName="瘟疫缠身"
mTooltip="施法时和接下来2个战斗回合开始时，%buff1.buff.special1 个随机敌方生物获得“瘟疫缠身”减益。受影响的生物拥有 %buff2.buff.stat %icon_attack 攻击，并在战斗回合结束时受到 %icon_dark 暗系伤害。战斗回合。受影响的生物拥有 %buff2.buff.stat %icon_attack 攻击，并在战斗回合结束时受到 %icon_dark 暗系伤害。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

[rework2.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="接下来的攻击自动错过目标友方生物。持续 %buff1.buff.durini 回合或直到所有攻击都未命中。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%buff1.buff.d.min 次攻击 和 %special1 %ICON_MANA 法力消耗"
mTooltipUpgraded=""
mName="暗影斗篷"
mTooltip="接下来的 %buff1.buff.d.min 次攻击自动错过目标友方生物。持续 %buff1.buff.durini 回合或直到所有攻击都未命中。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

v1.38

[Vampirisme.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="目标生物获得吸血能力，并在造成伤害时治疗自己。持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="目标生物获得吸血能力，并在造成伤害时治疗自己。持续 %buff1.buff.durini 回合。"
mTooltipUpgraded="6X6区域内的目标生物获得吸血能力，并在造成伤害时治疗 %buff1.buff.d1 %icon_health 生命值。持续时间：%buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mName="吸血"
mTooltip="目标生物获得吸血能力，并在造成伤害时治疗自己 %buff1.buff.d1 %icon_health 生命值。持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"